api-wordlist/app/controllers/words_controller.rb

  def index
    words = Word.all
---
SELECT "words".* FROM "words"

  def show
    word = Word.find_by(id: params[:id])
---
SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    word = Word.new(word_params)

    if word.save
---
INSERT INTO "words" ("word", "definition", "sentence", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_word
      @word = Word.find(params[:id])
---
SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]